prepared_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.;

vertices
(
	(-5 -3 0)
	(0 -3 0)
	(15 -3 0)
	(-5 0 0)

	(-3 0 0)
	(-0.5 0 0)
	(0 -0.5 0)
	(0.5 0 0)

	(3 0 0)
	(15 0 0)
	(0 0.5 0)
	(-5 3 0)

	(0 3 0)
	(15 3 0)



	(-5 -3 0.1)
	(0 -3 0.1)
	(15 -3 0.1)
	(-5 0 0.1)

	(-3 0 0.1)
	(-0.5 0 0.1)
	(0 -0.5 0.1)
	(0.5 0 0.1)

	(3 0 0.1)
	(15 0 0.1)
	(0 0.5 0.1)
	(-5 3 0.1)

	(0 3 0.1)
	(15 3 0.1)


);


edges
(
arc 5 6 (-0.3536 -0.3536 0)
arc 6 7 (0.3536 -0.3536 0)

arc 7 10 (0.3536 0.3536 0)
arc 5 10 (-0.3536 0.3536 0)

arc 19 20 (-0.3536 -0.3536 0.1)
arc 20 21 (0.3536 -0.3536 0.1)

arc 21 24 (0.3536 0.3536 0.1)
arc 19 24 (-0.3536 0.3536 0.1)

);


blocks
(
    hex (0 1 4 3 14 15 18 17) (50 30 1) simpleGrading (1 1 1)
    hex (1 6 5 4 15 20 19 18) (30 30 1) simpleGrading (1 1 1)
    hex (1 8 7 6 15 22 21 20) (30 30 1) simpleGrading (1 1 1)
    hex (1 2 9 8 15 16 23 22) (150 30 1) simpleGrading (1 1 1)
    hex (3 4 12 11 17 18 26 25) (50 30 1) simpleGrading (1 1 1)
    hex (4 5 10 12 18 19 24 26) (30 30 1) simpleGrading (1 1 1)
    hex (7 8 12 10 21 22 26 24) (30 30 1) simpleGrading (1 1 1)
    hex (8 9 13 12 22 23 27 26) (150 30 1) simpleGrading (1 1 1)
);


boundary
(

    in_flow
    {
        type wall;
        faces
        (
            (0 14 17 3)
	    (3 17 25 11)
        );
    }
    out_flow
    {
        type wall;
        faces
        (
            (2 16 23 9)
	    (9 23 27 13)
        );
    }
    fixed
    {
        type wall;
        faces
        (
            (0 1 15 14)
            (1 2 16 15)

            (11 12 26 25)
            (12 13 27 26)

	    (5 6 20 19)
	    (5 10 24 19)

	    (6 7 21 20)
	    (10 7 21 24)

        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (1 6 5 4)
            (1 8 7 6)
            (1 2 9 8)
            (3 4 12 11)
            (4 5 10 12)
            (7 8 12 10)
            (8 9 13 12)

            (14 15 18 17)
            (15 20 19 18)
            (15 22 21 20)
            (15 16 23 22)
            (17 18 26 25)
            (18 19 24 26)
            (21 22 26 24)
            (22 23 27 26)
        );
    }



);

mergePatchPairs
(
);

// ************************************************************************* //
